In [1]:
from IPython.display import display, HTML
display(HTML("""
<style>
div.container{width:86% !important;}
div.cell.code_cell.rendered{width:100%;}
div.CodeMirror {font-family:Consolas; font-size:12pt;}
div.output {font-size:15pt; font-weight:bold;}
div.input {font-family:Consolas; font-size:12pt;}
div.prompt {min-width:70px;}
div#toc-wrapper{padding-top:120px;}
div.text_cell_render ul li{font-size:12pt;padding:5px;}
table.dataframe{font-size:15px;}
</style>
"""))

<b><font size="6" color="red"> ch11. 데이터프레임과 시리즈(Pandas)</font></b>
- pip install pandas / conda install pandas(아나콘다 프롬프트)
# 1절. 판다스 패키지
- 데이터 분석을 위해 반드시 알아야 할 패키지. 넘파이 기반으로 다른 많은 라이브러리와 잘 통합되도록 설계
- 1차원 구조를 갖는 시리즈, 2차원 구조를 갖는 데이터프레임(excel의 스프레드시트)을 제공
- 판다스의 장점 : 파일io, 부분 데이터 추출, 크기 변경, 데이터 분할, 병합, 정렬, 결측치 처리, 데이터 분할,
                        피벗과 언피벗(롱 <-> 와이드)
                
- [Pandas API reference](https://pandas.pydata.org/docs/reference/index.html)
- [Pandas docs](https://pandas.pydata.org/docs/index.html)

In [2]:
import pandas as pd
pd.__version__

'1.5.3'

In [8]:
data = pd.read_csv('data/ch09_member4.csv') # encoding='utf-8'이 가본값
display(data)
type(data)

  name  age    email address
0  홍길동   22  a@a.com     신림동
1  신길동   32  b@a.com     신림동
2  김길동   42  c@a.com     신림동

pandas.core.frame.DataFrame

In [11]:
data = pd.read_csv('data/ch09_member1.csv', 
                   header=None,
                   names=['name', 'age', 'email', 'address'])
data.head(2) # 최초 상위 2줄만

  name  age             email   address
0  홍길동   20  kildong@hong.com   서울시 관악구
1  김길동   40  kimdong@hong.com  서울시 영등포구

In [12]:
data = pd.read_json('data/ch09_member.json') # 기본값 : utf-8
data

  name  age             email address
0  홍길동   20  kildong@hong.com      서울
1  김길동   30  kimdong@hong.com      인천

In [13]:
iris = pd.read_hdf('data/ch09_iris.hdf5', key='iris')
iris.head() # 상위 5개

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

# 2절. 데이터 프레임 만들기
## 2.1 딕셔너리를 이용한 데이터 프레임 만들기

In [14]:
d = {'kor':[100,50], 'mat':[95,99]} # 딕셔너리를 데이터프레임으로
df = pd.DataFrame(data=d)
df

   kor  mat
0  100   95
1   50   99

In [16]:
df.to_dict() # 데이터프레임 -> 딕셔너리
# 데이터프레임을 딕셔너리로 변환 시 형식이 달라짐

{'kor': {0: 100, 1: 50}, 'mat': {0: 95, 1: 99}}

In [17]:
df.to_numpy()

array([[100,  95],
       [ 50,  99]], dtype=int64)

In [22]:
# 딕셔너리 리스트를 데이터프레임으로
d = [{'kor':100, 'mat':95}, {'kor':'50', 'mat':99}] # 칼럼내 타입 동일화
df = pd.DataFrame(data=d)
df

   kor  mat
0  100   95
1   50   99

In [23]:
df.dtypes

kor    object
mat     int64
dtype: object

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   kor     2 non-null      object
 1   mat     2 non-null      int64
dtypes: int64(1), object(1)
memory usage: 160.0+ bytes

In [27]:
d = [{'kor':100, 'mat':100}, {'kor':90, 'mat':91}, {'kor':93, 'eng':100}]
df = pd.DataFrame(data=d) # 결측치는 실수형(float64) - 정수형 변환 불가능 -> 결측치 대체 후 정수형 변환
df

   kor    mat   math
0  100  100.0    NaN
1   90   91.0    NaN
2   93    NaN  100.0

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   kor     3 non-null      int64
 1   mat     2 non-null      float64
 2   math    1 non-null      float64
dtypes: float64(2), int64(1)
memory usage: 200.0 bytes

## 2.2 리스트를 이용한 데이터프레임 만들기

In [30]:
title = ['책1','책2','책3']
price = [15000, 18000, 10000]
df = pd.DataFrame(data={'title':title, 'price':price})
df

  title  price
0    책1  15000
1    책2  18000
2    책3  10000

In [31]:
import numpy as np
np.c_[title, price]

array([['책1', '15000'],
       ['책2', '18000'],
       ['책3', '10000']], dtype='<U11')

In [36]:
df = pd.DataFrame(np.c_[title, price], columns=['책이름', '가격'])
df

  책이름     가격
0  책1  15000
1  책2  18000
2  책3  10000

## 2.3 read_csv

In [43]:
%ls c:\ai_x\download\shareData\소상공인시장진흥공단_상가(상권)정보_20250331

 C 드라이브의 볼륨에는 이름이 없습니다.
 볼륨 일련 번호: 3664-591E

 c:\ai_x\download\shareData\소상공인시장진흥공단_상가(상권)정보_20250331 디렉터리

2025-04-28  오후 03:50    <DIR>          .
2025-04-28  오후 03:50    <DIR>          ..
2025-04-21  오후 03:13             1,011 [필독]파일열람방법.txt
2025-04-21  오후 03:21        61,227,944 소상공인시장진흥공단_상가(상권)정보_강원_202503.csv
2025-04-21  오후 03:21       356,572,082 소상공인시장진흥공단_상가(상권)정보_경기_202503.csv
2025-04-21  오후 03:22        93,472,559 소상공인시장진흥공단_상가(상권)정보_경남_202503.csv
2025-04-21  오후 03:22        76,425,275 소상공인시장진흥공단_상가(상권)정보_경북_202503.csv
2025-04-21  오후 03:22        40,070,868 소상공인시장진흥공단_상가(상권)정보_광주_202503.csv
2025-04-21  오후 03:22        61,715,005 소상공인시장진흥공단_상가(상권)정보_대구_202503.csv
2025-04-21  오후 03:23        41,491,092 소상공인시장진흥공단_상가(상권)정보_대전_202503.csv
2025-04-21  오후 03:23        84,550,600 소상공인시장진흥공단_상가(상권)정보_부산_202503.csv
2025-04-21  오후 03:23       294,549,483 소상공인시장진흥공단_상가(상권)정보_서울_202503.csv
2025-04-21  오후 03:23         9,303,432 소상공인시장진흥공단_상가(상권)정보_세종_202503.csv
2025-04-21  오후 03:23        28,457,489 소상공인시장진흥공단_상가(상권)정보_울산_202503.csv
2025-04-21  오후 03:23        73,022,149 소상공인시장진흥공단_상가(상권)정보_인천_202503.csv
2025-04-21  오후 03:23        52,997,974 소상공인시장진흥공단_상가(상권)정보_전남_202503.csv
2025-04-21  오후 03:24        56,252,705 소상공인시장진흥공단_상가(상권)정보_전북_202503.csv
2025-04-21  오후 03:24        32,943,677 소상공인시장진흥공단_상가(상권)정보_제주_202503.csv
2025-04-21  오후 03:24        66,591,896 소상공인시장진흥공단_상가(상권)정보_충남_202503.csv
2025-04-21  오후 03:21        50,727,673 소상공인시장진흥공단_상가(상권)정보_충북_202503.csv
              18개 파일       1,480,372,914 바이트
               2개 디렉터리  162,586,841,088 바이트 남음

In [52]:
df = pd.read_csv(r'C:\ai_x\download\shareData\상가정보\소상공인시장진흥공단_상가(상권)정보_세종_202503.csv',
                low_memory=False, # 데이터 용량이 클 경우만 기입
                nrows=30) # 처음 30행만
df.shape

(30, 39)

In [55]:
df.head(1)

,상가업소번호,상호명,지점명,상권업종대분류코드,상권업종대분류명,상권업종중분류코드,상권업종중분류명,상권업종소분류코드,상권업종소분류명,표준산업분류코드,표준산업분류명,시도코드,시도명,시군구코드,시군구명,행정동코드,행정동명,법정동코드,법정동명,지번코드,대지구분코드,대지구분명,지번본번지,지번부번지,지번주소,도로명코드,도로명,건물본번지,건물부번지,건물관리번호,건물명,도로명주소,구우편번호,신우편번호,동정보,층정보,호정보,경도,위도
0,MA010120220700019175,세종수이비인후과의원,NaN,Q1,보건의료,Q102,의원,Q10201,내과/소아과 의원,Q86201,일반의원,36,세종특별자치시,36110,세종특별자치시,36110525,해밀동,3611011600,해밀동,3611011600200050002,2,산,5,2.0,세종특별자치시 세종특별자치시 해밀동 산5-2,361103352828,세종특별자치시 세종특별자치시 해밀3로,43,NaN,3611011600200050002000001,행정중심복합도시,세종특별자치시 세종특별자치시 해밀3로 43,NaN,30092,NaN,NaN,NaN,127.264487,36.528585

In [53]:
#판다스 디스플레이 옵션
pd.options.display.max_columns = 39 # 기본값 : 20, 39열까지 display 가능
pd.options.display.max_rows = 40 # 기본값 : 60 , 40행까지 display 가능
df.head()

,상가업소번호,상호명,지점명,상권업종대분류코드,상권업종대분류명,상권업종중분류코드,상권업종중분류명,상권업종소분류코드,상권업종소분류명,표준산업분류코드,표준산업분류명,시도코드,시도명,시군구코드,시군구명,행정동코드,행정동명,법정동코드,법정동명,지번코드,대지구분코드,대지구분명,지번본번지,지번부번지,지번주소,도로명코드,도로명,건물본번지,건물부번지,건물관리번호,건물명,도로명주소,구우편번호,신우편번호,동정보,층정보,호정보,경도,위도
0,MA010120220700019175,세종수이비인후과의원,NaN,Q1,보건의료,Q102,의원,Q10201,내과/소아과 의원,Q86201,일반의원,36,세종특별자치시,36110,세종특별자치시,36110525,해밀동,3611011600,해밀동,3611011600200050002,2,산,5,2.0,세종특별자치시 세종특별자치시 해밀동 산5-2,361103352828,세종특별자치시 세종특별자치시 해밀3로,43,NaN,3611011600200050002000001,행정중심복합도시,세종특별자치시 세종특별자치시 해밀3로 43,NaN,30092,NaN,NaN,NaN,127.264487,36.528585
1,MA010120220800005576,우보설렁탕,NaN,I2,음식,I201,한식,I20102,국/탕/찌개류,I56111,한식 일반 음식점업,36,세종특별자치시,36110,세종특별자치시,36110250,조치원읍,3611025023,조치원읍,3611025023100230051,1,대지,23,51.0,세종특별자치시 세종특별자치시 조치원읍 평리 23-51,361103258043,세종특별자치시 세종특별자치시 조치원읍 문화로,24,NaN,4473025023100230051035586,NaN,세종특별자치시 세종특별자치시 조치원읍 문화로 24,339885.0,30025,NaN,NaN,NaN,127.301068,36.603770
2,MA010120220800006182,메이빈,NaN,I2,음식,I212,비알코올,I21201,카페,I56221,커피 전문점,36,세종특별자치시,36110,세종특별자치시,36110560,보람동,3611010300,보람동,3611010300107050000,1,대지,705,NaN,세종특별자치시 세종특별자치시 보람동 705,361102348105,세종특별자치시 세종특별자치시 시청대로,127,NaN,3611010300106640011000001,강남프라자,세종특별자치시 세종특별자치시 시청대로 127,339008.0,30151,NaN,3.0,NaN,127.286081,36.479674
3,MA010120220800008970,명품동태탕,NaN,I2,음식,I201,한식,I20102,국/탕/찌개류,I56111,한식 일반 음식점업,36,세종특별자치시,36110,세종특별자치시,36110350,장군면,3611035024,장군면,3611035024103040008,1,대지,304,8.0,세종특별자치시 세종특별자치시 장군면 봉안리 304-8,361104574659,세종특별자치시 세종특별자치시 장군면 월현윗길,29,NaN,3611035024103040008000001,행복마을,세종특별자치시 세종특별자치시 장군면 월현윗길 29,339914.0,30055,NaN,1.0,NaN,127.223073,36.501346
4,MA010120220800024017,컴119,NaN,S2,수리·개인,S201,컴퓨터 수리,S20101,컴퓨터/노트북/프린터 수리업,S95110,컴퓨터 및 주변 기기 수리업,36,세종특별자치시,36110,세종특별자치시,36110510,한솔동,3611010600,한솔동,3611010600109670000,1,대지,967,NaN,세종특별자치시 세종특별자치시 한솔동 967,361103258060,세종특별자치시 세종특별자치시 노을3로,99,NaN,3611010600102180000000001,골든타원,세종특별자치시 세종특별자치시 노을3로 99,339014.0,30130,NaN,2.0,NaN,127.253843,36.479828

In [54]:
df.head(1).T

                                   0
상가업소번호          MA010120220700019175
상호명                       세종수이비인후과의원
지점명                              NaN
상권업종대분류코드                         Q1
상권업종대분류명                        보건의료
상권업종중분류코드                       Q102
상권업종중분류명                          의원
상권업종소분류코드                     Q10201
상권업종소분류명                   내과/소아과 의원
표준산업분류코드                      Q86201
표준산업분류명                         일반의원
시도코드                              36
시도명                          세종특별자치시
시군구코드                          36110
시군구명                         세종특별자치시
행정동코드                       36110525
행정동명                             해밀동
법정동코드                     3611011600
법정동명                             해밀동
지번코드             3611011600200050002
대지구분코드                             2
대지구분명                              산
지번본번지                              5
지번부번지                            2.0
지번주소        세종특별자치시 세종특별자치시 해밀동 산5-2
도로명코드                   361103352828
도로명             세종특별자치시 세종특별자치시 해밀3로
건물본번지                             43
건물부번지                            NaN
건물관리번호     3611011600200050002000001
건물명                         행정중심복합도시
도로명주소        세종특별자치시 세종특별자치시 해밀3로 43
구우편번호                            NaN
신우편번호                          30092
동정보                              NaN
층정보                              NaN
호정보                              NaN
경도                        127.264487
위도                         36.528585

In [68]:
# (1) csv 파일 불러오기(기본값)
# encoding='utf-8', sep=',', csv파일의 첫 번째 줄을 header로 인식, #이 있는 줄도 데이터로 인식
member = pd.read_csv('data/ch11_member.csv')
member

   Name  Age          Email  Address       Birth
0   홍길동   20  hong@hong.com  서울시 강동구  1999-01-01
1   홍길서   30   seo@hong.com   서울시 중구  1999-12-01
2   홍길남   21   nam@hong.com  서울시 강동구  1999-11-01
3   홍길북   22   buk@hong.com  서울시 관악구  1999-05-01
4   홍길중   23   mid@hong.com   부산시 중구  1999-01-30
5  #홍길뜽   24    non@not.com      없는구  2000-01-01

In [69]:
member.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     6 non-null      object
 1   Age      6 non-null      int64
 2   Email    6 non-null      object
 3   Address  6 non-null      object
 4   Birth    6 non-null      object
dtypes: int64(1), object(4)
memory usage: 368.0+ bytes

In [70]:
# 형변환 Age열 : int64 -> int16
member['Age'] = member['Age'].astype(np.int16) # 시리즈
# member['Age'].astype('int') # 'int' : np.int32
member.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     6 non-null      object
 1   Age      6 non-null      int16
 2   Email    6 non-null      object
 3   Address  6 non-null      object
 4   Birth    6 non-null      object
dtypes: int16(1), object(4)
memory usage: 332.0+ bytes

In [71]:
# 형변환 Birth열 : object(문자열) -> datetime64 (최신버전 : datetime64[ns])
member['Birth_as'] = member['Birth'].astype('datetime64')
member.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      object
 1   Age       6 non-null      int16
 2   Email     6 non-null      object
 3   Address   6 non-null      object
 4   Birth     6 non-null      object
 5   Birth_as  6 non-null      datetime64[ns]
dtypes: datetime64[ns](1), int16(1), object(4)
memory usage: 380.0+ bytes

In [72]:
member['Birth_to'] = pd.to_datetime(member['Birth']) # astype() 함수보다 안전한 형변환
member.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      object
 1   Age       6 non-null      int16
 2   Email     6 non-null      object
 3   Address   6 non-null      object
 4   Birth     6 non-null      object
 5   Birth_as  6 non-null      datetime64[ns]
 6   Birth_to  6 non-null      datetime64[ns]
dtypes: datetime64[ns](2), int16(1), object(4)
memory usage: 428.0+ bytes

In [74]:
# (2) 특정 행만 제외하고 csv 파일 읽기
member = pd.read_csv('data/ch11_membercp949.csv', 
                     encoding='cp949',
                     skiprows=[1, 6]) # 1,6번째 행 제외
member

  Name  Age         Email  Address       Birth
0  홍길서   30  seo@hong.com   서울시 중구  1999-12-01
1  홍길남   21  nam@hong.com  서울시 강동구  1999-11-01
2  홍길북   22  buk@hong.com  서울시 관악구  1999-05-01
3  홍길중   23  mid@hong.com   부산시 중구  1999-01-30

In [80]:
# (3) 주석(#) 제외, datetime형 필드(생일 등) 지정하여  csv 파일 읽기
member = pd.read_csv('data/ch11_membertab.csv',
                     sep='\t',
                     comment='#',  # #이붙은 줄은 주석 처리
                     parse_dates=['Birth']) # datetime 형으로 읽을 field 지정
member

  Name  Age          Email  Address      Birth
0  홍길동   20  hong@hong.com  서울시 강동구 1999-01-01
1  홍길서   30   seo@hong.com   서울시 중구 1999-12-01
2  홍길남   21   nam@hong.com  서울시 강동구 1999-11-01
3  홍길북   22   buk@hong.com  서울시 관악구 1999-05-01
4  홍길중   23   mid@hong.com   부산시 중구 1999-01-30

In [83]:
# (4) sep = '|', 상위 5행만 읽기
member = pd.read_csv('data/ch11_membersep.csv',
                     sep='|',
                     nrows=5)
member

  Name  Age          Email  Address       Birth
0  홍길동   20  hong@hong.com  서울시 강동구  1999-01-01
1  홍길서   30   seo@hong.com   서울시 중구  1999-12-01
2  홍길남   21   nam@hong.com  서울시 강동구  1999-11-01
3  홍길북   22   buk@hong.com  서울시 관악구  1999-05-01
4  홍길중   23   mid@hong.com   부산시 중구  1999-01-30

## 2.4 패키지에서 가져오기 : iris 데이터
- iris 가져오기 방법 1 : sklearn(머신러닝 패키지) - numpy
- iris 가져오기 방법 2 : statsmodels(R 언어 데이터) - 인터넷 연결 필요
- iris 가져오기 방법 3 : seaborn(시각화 패키지) - 데이터프레임
### iris 가져오기 방법 1 : sklearn(머신러닝 패키지)

In [87]:
from sklearn import datasets # sklearn : 머신러닝을 위한 함수(전처리함수, 머신러닝함수, 성능평가함수, 학습데이터셋 다수 보유)
iris = datasets.load_iris()
iris.keys() # 딕셔너리 형태

dict_keys(['data', 'target', 'frame', 'target_names', 'DESCR', 'feature_names', 'filename', 'data_module'])

In [88]:
print(iris.DESCR) # iris 데이터 셋에 대한 설명

.. _iris_dataset:

Iris plants dataset
--------------------

**Data Set Characteristics:**

    :Number of Instances: 150 (50 in each of three classes)
    :Number of Attributes: 4 numeric, predictive attributes and the class
    :Attribute Information:
        - sepal length in cm
        - sepal width in cm
        - petal length in cm
        - petal width in cm
        - class:
                - Iris-Setosa
                - Iris-Versicolour
                - Iris-Virginica

    :Summary Statistics:

    ============== ==== ==== ======= ===== ====================
                    Min  Max   Mean    SD   Class Correlation
    ============== ==== ==== ======= ===== ====================
    sepal length:   4.3  7.9   5.84   0.83    0.7826
    sepal width:    2.0  4.4   3.05   0.43   -0.4194
    petal length:   1.0  6.9   3.76   1.76    0.9490  (high!)
    petal width:    0.1  2.5   1.20   0.76    0.9565  (high!)
    ============== ==== ==== ======= ===== ====================

    :Missing Attribute Values: None
    :Class Distribution: 33.3% for each of 3 classes.
    :Creator: R.A. Fisher
    :Donor: Michael Marshall (MARSHALL%PLU@io.arc.nasa.gov)
    :Date: July, 1988

The famous Iris database, first used by Sir R.A. Fisher. The dataset is taken
from Fisher's paper. Note that it's the same as in R, but not as in the UCI
Machine Learning Repository, which has two wrong data points.

This is perhaps the best known database to be found in the
pattern recognition literature.  Fisher's paper is a classic in the field and
is referenced frequently to this day.  (See Duda & Hart, for example.)  The
data set contains 3 classes of 50 instances each, where each class refers to a
type of iris plant.  One class is linearly separable from the other 2; the
latter are NOT linearly separable from each other.

.. topic:: References

   - Fisher, R.A. "The use of multiple measurements in taxonomic problems"
     Annual Eugenics, 7, Part II, 179-188 (1936); also in "Contributions to
     Mathematical Statistics" (John Wiley, NY, 1950).
   - Duda, R.O., & Hart, P.E. (1973) Pattern Classification and Scene Analysis.
     (Q327.D83) John Wiley & Sons.  ISBN 0-471-22361-1.  See page 218.
   - Dasarathy, B.V. (1980) "Nosing Around the Neighborhood: A New System
     Structure and Classification Rule for Recognition in Partially Exposed
     Environments".  IEEE Transactions on Pattern Analysis and Machine
     Intelligence, Vol. PAMI-2, No. 1, 67-71.
   - Gates, G.W. (1972) "The Reduced Nearest Neighbor Rule".  IEEE Transactions
     on Information Theory, May 1972, 431-433.
   - See also: 1988 MLC Proceedings, 54-64.  Cheeseman et al"s AUTOCLASS II
     conceptual clustering system finds 3 classes in the data.
   - Many, many more ...

In [89]:
iris.data # 독립변수
iris['data'][:3]

array([[5.1, 3.5, 1.4, 0.2],
       [4.9, 3. , 1.4, 0.2],
       [4.7, 3.2, 1.3, 0.2]])

In [90]:
iris.feature_names # 독립변수의 열 이름(column 이름)
iris['feature_names']

['sepal length (cm)',
 'sepal width (cm)',
 'petal length (cm)',
 'petal width (cm)']

In [98]:
# 데이터 프레임에서 열 이름
columns = [col[:-5].replace(' ','_') for col in iris.feature_names] + ['species']
columns

['sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'species']

In [102]:
iris.target
iris['target'] # 머신러닝 시 종속변수

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2])

In [103]:
iris.target_names

array(['setosa', 'versicolor', 'virginica'], dtype='<U10')

In [106]:
iris['target_names'][iris['target']]
iris.target_names[iris.target]

array(['setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica'], dtype='<U10')

In [108]:
data = iris.data # 독립변수
target = iris.target_names[iris.target] # 종속변수
data.shape, target.shape # 독립변수와 종속변수의 차원

((150, 4), (150,))

In [110]:
# 독립변수와 종속변수를 stack한 후 데이터프레임으로
pd.DataFrame(data = np.hstack( (data, target.reshape(-1,1) )),
             columns = columns)

    sepal_length sepal_width petal_length petal_width    species
0            5.1         3.5          1.4         0.2     setosa
1            4.9         3.0          1.4         0.2     setosa
2            4.7         3.2          1.3         0.2     setosa
3            4.6         3.1          1.5         0.2     setosa
4            5.0         3.6          1.4         0.2     setosa
..           ...         ...          ...         ...        ...
145          6.7         3.0          5.2         2.3  virginica
146          6.3         2.5          5.0         1.9  virginica
147          6.5         3.0          5.2         2.0  virginica
148          6.2         3.4          5.4         2.3  virginica
149          5.9         3.0          5.1         1.8  virginica

[150 rows x 5 columns]

### iris 가져오기 방법 2 : statsmodels(R 언어 데이터)

In [3]:
# R 언어에 있는 유명한 데이터셋을 가져오는 함수
from statsmodels.datasets import get_rdataset
iris_dataset = get_rdataset('iris',
                            package='datasets', # R의 datasets 패키지에서 가져옴
                            cache=True) # 한번 다운로드한 데이터set을 내 pc에 저장
iris_dataset

In [7]:
iris = iris_dataset.data
iris.head(1)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa

In [8]:
iris['Sepal.Length']
# iris.Sepal.Length # 열 이름에 '.', ' '이 있으면 iris.Sepal.Length 접근 불가

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: Sepal.Length, Length: 150, dtype: float64

In [9]:
iris.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

In [12]:
iris.columns = [col.lower().replace('.','_') for col in iris.columns]
iris.head(1)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa

### iris 가져오기 방법 3 : seaborn(시각화 패키지)

In [14]:
import seaborn as sns
iris = sns.load_dataset('iris')
iris.head(1)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa

In [15]:
# 데이터 프레임을 csv 파일로 저장
iris.to_csv('data/ch11_iris.csv',
#             sep=',', encoding='utf-8', # 기본값
            index=False) # 행 이름을 제외하고 출력

In [16]:
import pandas as pd
load_iris = pd.read_csv('data/ch11_iris.csv')
load_iris.head(1)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa

In [24]:
# 데이터 프레임의 용량이 클 경우 압축파일로 저장
iris.to_csv('data/ch11_iris.bz2', # .gz, .bz2도 가능
             index=False,
             compression='infer')

In [25]:
load_iris = pd.read_csv('data/ch11_iris.bz2',
                        compression='infer')
load_iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

# 3절. 이름(열, 행) 지정하기
## 3.1 열이름 지정하기

In [26]:
member = pd.read_csv('data/ch11_member.csv',
                     comment='#',
                     parse_dates=['Birth'])
member

  Name  Age          Email  Address      Birth
0  홍길동   20  hong@hong.com  서울시 강동구 1999-01-01
1  홍길서   30   seo@hong.com   서울시 중구 1999-12-01
2  홍길남   21   nam@hong.com  서울시 강동구 1999-11-01
3  홍길북   22   buk@hong.com  서울시 관악구 1999-05-01
4  홍길중   23   mid@hong.com   부산시 중구 1999-01-30

In [30]:
member.columns = ['이름', '나이', '이메일', '주소', '생년월일']
member.columns.name = None
member

    이름  나이            이메일       주소       생년월일
0  홍길동  20  hong@hong.com  서울시 강동구 1999-01-01
1  홍길서  30   seo@hong.com   서울시 중구 1999-12-01
2  홍길남  21   nam@hong.com  서울시 강동구 1999-11-01
3  홍길북  22   buk@hong.com  서울시 관악구 1999-05-01
4  홍길중  23   mid@hong.com   부산시 중구 1999-01-30

## 3.2 행이름 지정하기

In [31]:
member.index

RangeIndex(start=0, stop=5, step=1)

In [34]:
member.index = range(11, 16)
member

     이름  나이            이메일       주소       생년월일
11  홍길동  20  hong@hong.com  서울시 강동구 1999-01-01
12  홍길서  30   seo@hong.com   서울시 중구 1999-12-01
13  홍길남  21   nam@hong.com  서울시 강동구 1999-11-01
14  홍길북  22   buk@hong.com  서울시 관악구 1999-05-01
15  홍길중  23   mid@hong.com   부산시 중구 1999-01-30

In [35]:
member.index = ['동', '서', '남', '북', '중']
member

    이름  나이            이메일       주소       생년월일
동  홍길동  20  hong@hong.com  서울시 강동구 1999-01-01
서  홍길서  30   seo@hong.com   서울시 중구 1999-12-01
남  홍길남  21   nam@hong.com  서울시 강동구 1999-11-01
북  홍길북  22   buk@hong.com  서울시 관악구 1999-05-01
중  홍길중  23   mid@hong.com   부산시 중구 1999-01-30

In [38]:
print(member.index.name)

None

In [39]:
member.loc['남', '이름'] # loc을 이용하여 행이름과 열이름으로 데이터 부분 조회

'홍길남'

In [41]:
# 특정 열을 index로 세팅하고 싶을 때
# member를 수정하려면 (1) 할당 (2)inplace 매개변수에 True (기본값 : False)
member1 = member.set_index('이름') # 이름열이 index로 세팅
member1

     나이            이메일       주소       생년월일
이름
홍길동  20  hong@hong.com  서울시 강동구 1999-01-01
홍길서  30   seo@hong.com   서울시 중구 1999-12-01
홍길남  21   nam@hong.com  서울시 강동구 1999-11-01
홍길북  22   buk@hong.com  서울시 관악구 1999-05-01
홍길중  23   mid@hong.com   부산시 중구 1999-01-30

In [42]:
member.set_index('이름', inplace=True) # 이름열을 index로

In [44]:
member.head(1)

     나이            이메일       주소       생년월일
이름
홍길동  20  hong@hong.com  서울시 강동구 1999-01-01

In [45]:
member.reset_index(inplace=True) # index

In [46]:
member

    이름  나이            이메일       주소       생년월일
0  홍길동  20  hong@hong.com  서울시 강동구 1999-01-01
1  홍길서  30   seo@hong.com   서울시 중구 1999-12-01
2  홍길남  21   nam@hong.com  서울시 강동구 1999-11-01
3  홍길북  22   buk@hong.com  서울시 관악구 1999-05-01
4  홍길중  23   mid@hong.com   부산시 중구 1999-01-30

In [47]:
member.loc[1, '생년월일']

Timestamp('1999-12-01 00:00:00')

In [49]:
# 시리즈(날짜형).dt : datetime 열의 날짜 및 시간에 관련된 정보만 추출
member['생년월일'].dt.year

0    1999
1    1999
2    1999
3    1999
4    1999
Name: 생년월일, dtype: int64

In [51]:
member['생년월일'].dt.weekday # 0:월, 1:화, ..., 5:토, 6:일

0    4
1    2
2    0
3    5
4    5
Name: 생년월일, dtype: int64

## 3.3 레벨 이름 지정하기

In [52]:
member

    이름  나이            이메일       주소       생년월일
0  홍길동  20  hong@hong.com  서울시 강동구 1999-01-01
1  홍길서  30   seo@hong.com   서울시 중구 1999-12-01
2  홍길남  21   nam@hong.com  서울시 강동구 1999-11-01
3  홍길북  22   buk@hong.com  서울시 관악구 1999-05-01
4  홍길중  23   mid@hong.com   부산시 중구 1999-01-30

In [55]:
member.columns=[['기본정보','기본정보','기본정보','추가정보','추가정보'],
                ['이름','나이','메일','주소','생년월일']]
member.columns.names = ['대분류', '소분류']
member

대분류 기본정보                        추가정보
소분류   이름  나이             메일       주소       생년월일
0    홍길동  20  hong@hong.com  서울시 강동구 1999-01-01
1    홍길서  30   seo@hong.com   서울시 중구 1999-12-01
2    홍길남  21   nam@hong.com  서울시 강동구 1999-11-01
3    홍길북  22   buk@hong.com  서울시 관악구 1999-05-01
4    홍길중  23   mid@hong.com   부산시 중구 1999-01-30

In [57]:
member.index = [['좌우','좌우','상하','상하','상하'],
                ['동', '서', '남', '북', '중']]
member.index.names = ['레벨1','레벨2']
member

대분류     기본정보                        추가정보
소분류       이름  나이             메일       주소       생년월일
레벨1 레벨2
좌우  동    홍길동  20  hong@hong.com  서울시 강동구 1999-01-01
    서    홍길서  30   seo@hong.com   서울시 중구 1999-12-01
상하  남    홍길남  21   nam@hong.com  서울시 강동구 1999-11-01
    북    홍길북  22   buk@hong.com  서울시 관악구 1999-05-01
    중    홍길중  23   mid@hong.com   부산시 중구 1999-01-30

In [58]:
member.loc[('좌우','동'),'기본정보']

소분류
이름              홍길동
나이               20
메일    hong@hong.com
Name: (좌우, 동), dtype: object

# 4절. 부분 데이터 조회

In [60]:
member = pd.read_csv('data/ch11_member.csv',
                     comment='#',
                     parse_dates=['Birth'])
member

  Name  Age          Email  Address      Birth
0  홍길동   20  hong@hong.com  서울시 강동구 1999-01-01
1  홍길서   30   seo@hong.com   서울시 중구 1999-12-01
2  홍길남   21   nam@hong.com  서울시 강동구 1999-11-01
3  홍길북   22   buk@hong.com  서울시 관악구 1999-05-01
4  홍길중   23   mid@hong.com   부산시 중구 1999-01-30

## 4.1 열 조회

In [61]:
member['Name']
member.Name

0    홍길동
1    홍길서
2    홍길남
3    홍길북
4    홍길중
Name: Name, dtype: object

In [62]:
member[['Name', 'Email']]

  Name          Email
0  홍길동  hong@hong.com
1  홍길서   seo@hong.com
2  홍길남   nam@hong.com
3  홍길북   buk@hong.com
4  홍길중   mid@hong.com

In [ ]:
# member[0] 행을 조회할 경우 loc, iloc. []안에는 열 이름이나 조건만 사용 가능

## 4.2 loc을 이용한 조회
- df.loc[행이름,열이름] : 행이름과 열이름으로 조회
    * 행이름과 열이름 자리에 list ex.['Name','Email']
    * 행이름과 열이름 자리에 슬라이싱 from:to -> from부터 to까지 (from, to 포함)
    * ,열이름 생략 시 모든 열

In [63]:
# member 0행부터 2행
member.loc[:2]

  Name  Age          Email  Address      Birth
0  홍길동   20  hong@hong.com  서울시 강동구 1999-01-01
1  홍길서   30   seo@hong.com   서울시 중구 1999-12-01
2  홍길남   21   nam@hong.com  서울시 강동구 1999-11-01

In [64]:
member.index = ['동', '서', '남', '북', '중']
member

  Name  Age          Email  Address      Birth
동  홍길동   20  hong@hong.com  서울시 강동구 1999-01-01
서  홍길서   30   seo@hong.com   서울시 중구 1999-12-01
남  홍길남   21   nam@hong.com  서울시 강동구 1999-11-01
북  홍길북   22   buk@hong.com  서울시 관악구 1999-05-01
중  홍길중   23   mid@hong.com   부산시 중구 1999-01-30

In [65]:
# member 동행부터 남행
member.loc['동':'남']

  Name  Age          Email  Address      Birth
동  홍길동   20  hong@hong.com  서울시 강동구 1999-01-01
서  홍길서   30   seo@hong.com   서울시 중구 1999-12-01
남  홍길남   21   nam@hong.com  서울시 강동구 1999-11-01

In [66]:
# member 동행부터 남행, 'Name', 'Age', 'Email'
member.loc['동':'남', 'Name':'Email']

  Name  Age          Email
동  홍길동   20  hong@hong.com
서  홍길서   30   seo@hong.com
남  홍길남   21   nam@hong.com

In [67]:
# member 동행과 남행, 'Name':'Email', 'Address'
member.loc[['동','남'],['Name','Email','Address']]

  Name          Email  Address
동  홍길동  hong@hong.com  서울시 강동구
남  홍길남   nam@hong.com  서울시 강동구

In [69]:
# loc을 이용한 특정 열 조회
member.loc[:,['Name','Address']] # member['Name','Address']와 동일

  Name  Address
동  홍길동  서울시 강동구
서  홍길서   서울시 중구
남  홍길남  서울시 강동구
북  홍길북  서울시 관악구
중  홍길중   부산시 중구

In [70]:
member.loc['동'] # 특정 행이나 특정 열만 access -> 결과가 시리즈(1차원)로 출력됨

Name                       홍길동
Age                         20
Email            hong@hong.com
Address                서울시 강동구
Birth      1999-01-01 00:00:00
Name: 동, dtype: object

In [71]:
member.loc['동':'동'] # 슬라이싱의 경우 결과가 데이터프레임(2차원)으로 출력

  Name  Age          Email  Address      Birth
동  홍길동   20  hong@hong.com  서울시 강동구 1999-01-01

## 4.3 iloc을 이용한 조회
- df.iloc[행번호,열번호] : 행번호와 열번호로 조회
    * 행번호와 열번호 자리에 list ex.[0, 2]
    * 행번호와 열번호 자리에 슬라이싱 from:to:by -> from부터 to 앞까지 by씩 증감(to 미포함)
    * ,열번호 생략 시 모든 열

In [73]:
# 0번째 ~ 2번째 행 모든 열
# member.loc['동':'남']
member.iloc[0:3] # 열 번호 생략 시 모든 열

  Name  Age          Email  Address      Birth
동  홍길동   20  hong@hong.com  서울시 강동구 1999-01-01
서  홍길서   30   seo@hong.com   서울시 중구 1999-12-01
남  홍길남   21   nam@hong.com  서울시 강동구 1999-11-01

In [74]:
member.iloc[0] # 결과가 1차원이면 시리즈, 데이터프레임으로 하고자 하면 슬라이싱 이용 or pd.DataFrame() 함수 이용

Name                       홍길동
Age                         20
Email            hong@hong.com
Address                서울시 강동구
Birth      1999-01-01 00:00:00
Name: 동, dtype: object

In [75]:
# 짝수번째 행의 맨 마지막 열을 제외한 데이터 추출
member.iloc[::2, :-1]

  Name  Age          Email  Address
동  홍길동   20  hong@hong.com  서울시 강동구
남  홍길남   21   nam@hong.com  서울시 강동구
중  홍길중   23   mid@hong.com   부산시 중구

In [77]:
# 모든 행의 마지막 열만 데이터프레임으로 추출
member.iloc[:, -1:] # member.iloc[:, -1] # 1차원

       Birth
동 1999-01-01
서 1999-12-01
남 1999-11-01
북 1999-05-01
중 1999-01-30

In [78]:
# 0번째, 3번째 행 0번째, 3번째, 4번째 열
member.iloc[0:4:3, [0,3,4]]

  Name  Address      Birth
동  홍길동  서울시 강동구 1999-01-01
북  홍길북  서울시 관악구 1999-05-01

## 4.4 조건으로 조회
- df[조건] : 조건에 맞는 행(모든 열)
- df.loc[조건, 열이름] or df[조건][열이름] : 조건에 맞는 행의 특정 열

In [81]:
member

  Name  Age          Email  Address      Birth
동  홍길동   20  hong@hong.com  서울시 강동구 1999-01-01
서  홍길서   30   seo@hong.com   서울시 중구 1999-12-01
남  홍길남   21   nam@hong.com  서울시 강동구 1999-11-01
북  홍길북   22   buk@hong.com  서울시 관악구 1999-05-01
중  홍길중   23   mid@hong.com   부산시 중구 1999-01-30

In [83]:
member.Age > 22

동    False
서     True
남    False
북    False
중     True
Name: Age, dtype: bool

In [86]:
# Age 가 22보다 큰 데이터 셋 출력
member[member.Age > 22]

  Name  Age         Email Address      Birth
서  홍길서   30  seo@hong.com  서울시 중구 1999-12-01
중  홍길중   23  mid@hong.com  부산시 중구 1999-01-30

In [87]:
# Age가 22보다 큰 데이터의 Name과 Age
member[member.Age>22][['Name','Age']] # member[member.Age>22][['Name' : 'Age']] 불가

  Name  Age
서  홍길서   30
중  홍길중   23

In [88]:
# Age가 22보다 큰 데이터의 Name과 Age
member.loc[member.Age>22, ['Name','Age']]

  Name  Age
서  홍길서   30
중  홍길중   23

In [90]:
address1 = '서울시 강동구'
address2 = '부산시 중구'
print(address1.startswith('서울시'))
print(address2.startswith('서울시'))
print(address1.find('강동구') != -1)
print(address2.count('강동구') > 0)

True
False
True
False

※ 시리즈에 문자함수를 쓰기 위해 참조 :
https://pandas.pydata.org/pandas-docs/stable/reference/series.html#string-handling

In [92]:
member.Address.str.startswith('서울시')

동     True
서     True
남     True
북     True
중    False
Name: Address, dtype: bool

In [95]:
# Address가 '서울시'로 시작하는 행
member[member.Address.str.startswith('서울시')]

  Name  Age          Email  Address      Birth
동  홍길동   20  hong@hong.com  서울시 강동구 1999-01-01
서  홍길서   30   seo@hong.com   서울시 중구 1999-12-01
남  홍길남   21   nam@hong.com  서울시 강동구 1999-11-01
북  홍길북   22   buk@hong.com  서울시 관악구 1999-05-01

In [96]:
# Address에 '강동구'가 포함된 행
member[member.Address.str.count('강동구')>0]
member[member.Address.str.find('강동구')!=-1]

  Name  Age          Email  Address      Birth
동  홍길동   20  hong@hong.com  서울시 강동구 1999-01-01
남  홍길남   21   nam@hong.com  서울시 강동구 1999-11-01

In [97]:
# Address에 '강동구'가 포함된 'Name','Age'열 조회
member[member.Address.str.contains('강동구')][['Name','Age']]
member.loc[member.Address.str.contains('강동구'), 'Name':'Age']

  Name  Age
동  홍길동   20
남  홍길남   21

In [100]:
# 1999년도에 태어난 데이터
member[member.Birth.dt.year<2000]

  Name  Age          Email  Address      Birth
동  홍길동   20  hong@hong.com  서울시 강동구 1999-01-01
서  홍길서   30   seo@hong.com   서울시 중구 1999-12-01
남  홍길남   21   nam@hong.com  서울시 강동구 1999-11-01
북  홍길북   22   buk@hong.com  서울시 관악구 1999-05-01
중  홍길중   23   mid@hong.com   부산시 중구 1999-01-30

※ 데이터 프레임의 부분 데이터 조회 방법
- df[열이름] : 특정 열 모든 행 조회
- df[조건] : 조건에 맞는 모든 행 조회
- df.loc[행이름, 열이름] : 이름 조회, 조건(행이름 자리) 조회 가능
    * 열이름 생략 가능, 생략하면 모든 열
    * 행/열 이름 자리에 list, 슬라이싱 가능
- df.iloc[행번호, 열번호] : 번호 조회
    * 열번호 생략 가능, 생략하면 모든 열
    * 행/열 번호 자리에 list, 슬라이싱 가능

In [ ]:
# 1. sepal_length 열만 출력

# 2. 0~10행까지 마지막 열을 제외한 데이터 (loc, iloc)

# 3. 3~10 행중에 'sepal_length'와 'petal_length' 열만 (loc, iloc)

# 4. 0번째, 50번째, 100번째 행의 모든 열 (loc, iloc)

# 5. 0번째, 25, 50번째, 75번, 100번째, 125번째 행의 petal_length와 petal_width (loc, iloc)

# 6. species가 versicolor인 데이터의 모든 열

# 7. species가 setosa인 데이터 최초 5개 행만 출력

# 8. sepal_length가 6.5이상인 데이터 최초 5개 행만 출력

# 9. sepal_length가 7.2이상인 데이터의 'sepal_length'와 'sepal_width'와 'petal_length'

# 10. versicolor종중에서 sepal_length가 6.5보다 큰 데이터의 모든 열

In [101]:
import seaborn as sns
iris = sns.load_dataset('iris')
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [102]:
# 1. sepal_length 열만 출력
iris['sepal_length']

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: sepal_length, Length: 150, dtype: float64

In [158]:
# 2. 0~10행까지 마지막 열을 제외한 데이터 (loc, iloc)
iris.loc[:10,'sepal_length':'petal_width']
# iris.iloc[:11, :-1]

    sepal_length  sepal_width  petal_length  petal_width
0            5.1          3.5           1.4          0.2
1            4.9          3.0           1.4          0.2
2            4.7          3.2           1.3          0.2
3            4.6          3.1           1.5          0.2
4            5.0          3.6           1.4          0.2
5            5.4          3.9           1.7          0.4
6            4.6          3.4           1.4          0.3
7            5.0          3.4           1.5          0.2
8            4.4          2.9           1.4          0.2
9            4.9          3.1           1.5          0.1
10           5.4          3.7           1.5          0.2

In [127]:
# 3. 3~10 행중에 'sepal_length'와 'petal_length' 열만 (loc, iloc)
# iris.loc[3:10,['sepal_length','petal_length']]
iris.iloc[3:11:,[0,2]]

    sepal_length  petal_length
3            4.6           1.5
4            5.0           1.4
5            5.4           1.7
6            4.6           1.4
7            5.0           1.5
8            4.4           1.4
9            4.9           1.5
10           5.4           1.5

In [159]:
# 4. 0번째, 50번째, 100번째 행의 모든 열 (loc, iloc)
iris.loc[[0,50,100]]
# iris.iloc[0:101:50]

     sepal_length  sepal_width  petal_length  petal_width     species
0             5.1          3.5           1.4          0.2      setosa
50            7.0          3.2           4.7          1.4  versicolor
100           6.3          3.3           6.0          2.5   virginica

In [166]:
# 5. 0번째, 25, 50번째, 75번, 100번째, 125번째 행의 petal_length와 petal_width (loc, iloc)
# iris.loc[0:126:25,['petal_length','petal_width']] # 비추
# iris.loc[[0,25,50,75,100,125],['petal_length','petal_width']]
iris.iloc[0:126:25,[2,3]]

     petal_length  petal_width
0             1.4          0.2
25            1.6          0.2
50            4.7          1.4
75            4.4          1.4
100           6.0          2.5
125           6.0          1.8

In [142]:
# 6. species가 versicolor인 데이터의 모든 열
iris[iris.species.str.find('versicolor')==0]

    sepal_length  sepal_width  petal_length  petal_width     species
50           7.0          3.2           4.7          1.4  versicolor
51           6.4          3.2           4.5          1.5  versicolor
52           6.9          3.1           4.9          1.5  versicolor
53           5.5          2.3           4.0          1.3  versicolor
54           6.5          2.8           4.6          1.5  versicolor
55           5.7          2.8           4.5          1.3  versicolor
56           6.3          3.3           4.7          1.6  versicolor
57           4.9          2.4           3.3          1.0  versicolor
58           6.6          2.9           4.6          1.3  versicolor
59           5.2          2.7           3.9          1.4  versicolor
60           5.0          2.0           3.5          1.0  versicolor
61           5.9          3.0           4.2          1.5  versicolor
62           6.0          2.2           4.0          1.0  versicolor
63           6.1          2.9           4.7          1.4  versicolor
64           5.6          2.9           3.6          1.3  versicolor
65           6.7          3.1           4.4          1.4  versicolor
66           5.6          3.0           4.5          1.5  versicolor
67           5.8          2.7           4.1          1.0  versicolor
68           6.2          2.2           4.5          1.5  versicolor
69           5.6          2.5           3.9          1.1  versicolor
70           5.9          3.2           4.8          1.8  versicolor
71           6.1          2.8           4.0          1.3  versicolor
72           6.3          2.5           4.9          1.5  versicolor
73           6.1          2.8           4.7          1.2  versicolor
74           6.4          2.9           4.3          1.3  versicolor
75           6.6          3.0           4.4          1.4  versicolor
76           6.8          2.8           4.8          1.4  versicolor
77           6.7          3.0           5.0          1.7  versicolor
78           6.0          2.9           4.5          1.5  versicolor
79           5.7          2.6           3.5          1.0  versicolor
80           5.5          2.4           3.8          1.1  versicolor
81           5.5          2.4           3.7          1.0  versicolor
82           5.8          2.7           3.9          1.2  versicolor
83           6.0          2.7           5.1          1.6  versicolor
84           5.4          3.0           4.5          1.5  versicolor
85           6.0          3.4           4.5          1.6  versicolor
86           6.7          3.1           4.7          1.5  versicolor
87           6.3          2.3           4.4          1.3  versicolor
88           5.6          3.0           4.1          1.3  versicolor
89           5.5          2.5           4.0          1.3  versicolor
90           5.5          2.6           4.4          1.2  versicolor
91           6.1          3.0           4.6          1.4  versicolor
92           5.8          2.6           4.0          1.2  versicolor
93           5.0          2.3           3.3          1.0  versicolor
94           5.6          2.7           4.2          1.3  versicolor
95           5.7          3.0           4.2          1.2  versicolor
96           5.7          2.9           4.2          1.3  versicolor
97           6.2          2.9           4.3          1.3  versicolor
98           5.1          2.5           3.0          1.1  versicolor
99           5.7          2.8           4.1          1.3  versicolor

In [167]:
# 7. species가 setosa인 데이터 최초 5개 행만 출력
iris[iris.species=='setosa'][:5]

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [168]:
# 8. sepal_length가 6.5이상인 데이터 최초 5개 행만 출력
iris[iris.sepal_length>=6.5].iloc[:5]

    sepal_length  sepal_width  petal_length  petal_width     species
50           7.0          3.2           4.7          1.4  versicolor
52           6.9          3.1           4.9          1.5  versicolor
54           6.5          2.8           4.6          1.5  versicolor
58           6.6          2.9           4.6          1.3  versicolor
65           6.7          3.1           4.4          1.4  versicolor

In [155]:
# 9. sepal_length가 7.2이상인 데이터의 'sepal_length'와 'sepal_width'와 'petal_length'
iris[iris.sepal_length>=7.2].loc[:,['sepal_length','sepal_width','petal_length']]

     sepal_length  sepal_width  petal_length
105           7.6          3.0           6.6
107           7.3          2.9           6.3
109           7.2          3.6           6.1
117           7.7          3.8           6.7
118           7.7          2.6           6.9
122           7.7          2.8           6.7
125           7.2          3.2           6.0
129           7.2          3.0           5.8
130           7.4          2.8           6.1
131           7.9          3.8           6.4
135           7.7          3.0           6.1

In [178]:
# 10. versicolor종중에서 sepal_length가 6.5보다 큰 데이터의 모든 열
# iris[iris.species=='versicolor'][iris.sepal_length>6.5]
# iris[(iris.species=='versicolor') & (iris.sepal_length>6.5)]
iris[np.logical_and(iris.species=='versicolor',
               iris.sepal_length>6.5)]

    sepal_length  sepal_width  petal_length  petal_width     species
50           7.0          3.2           4.7          1.4  versicolor
52           6.9          3.1           4.9          1.5  versicolor
58           6.6          2.9           4.6          1.3  versicolor
65           6.7          3.1           4.4          1.4  versicolor
75           6.6          3.0           4.4          1.4  versicolor
76           6.8          2.8           4.8          1.4  versicolor
77           6.7          3.0           5.0          1.7  versicolor
86           6.7          3.1           4.7          1.5  versicolor

In [175]:
import numpy as np
np.logical_and(True, True)

True

# 5절. 데이터 추가 및 삭제
## 5.1 데이터 프레임의 요소 삭제
- df.drop(행/열이름, axis) : axis=0 - 행삭제 / axis=1 - 열삭제

In [241]:
member = pd.read_csv('data/ch11_member.csv', comment='#')
member.index = ['동', '서', '남', '북', '중']
member

  Name  Age          Email  Address       Birth
동  홍길동   20  hong@hong.com  서울시 강동구  1999-01-01
서  홍길서   30   seo@hong.com   서울시 중구  1999-12-01
남  홍길남   21   nam@hong.com  서울시 강동구  1999-11-01
북  홍길북   22   buk@hong.com  서울시 관악구  1999-05-01
중  홍길중   23   mid@hong.com   부산시 중구  1999-01-30

In [242]:
# (1) 단일 행 삭제
member.drop('중') # axis=0 이 기본값

  Name  Age          Email  Address       Birth
동  홍길동   20  hong@hong.com  서울시 강동구  1999-01-01
서  홍길서   30   seo@hong.com   서울시 중구  1999-12-01
남  홍길남   21   nam@hong.com  서울시 강동구  1999-11-01
북  홍길북   22   buk@hong.com  서울시 관악구  1999-05-01

In [243]:
# '동'행이 없으면 에러
member.drop('동', inplace=True)

In [244]:
# (2) 복수행 삭제
member.drop(['서','남'])

  Name  Age         Email  Address       Birth
북  홍길북   22  buk@hong.com  서울시 관악구  1999-05-01
중  홍길중   23  mid@hong.com   부산시 중구  1999-01-30

In [245]:
# (3) 열 삭제
member.drop(['Age','Birth'], axis=1)

  Name         Email  Address
서  홍길서  seo@hong.com   서울시 중구
남  홍길남  nam@hong.com  서울시 강동구
북  홍길북  buk@hong.com  서울시 관악구
중  홍길중  mid@hong.com   부산시 중구

## 5.2 데이터 프레임의 요소 추가

In [246]:
# 데이터 프레임에 열 추가1 : 공통된 값으로 추가
member['favarite_no'] = 7 # int64
member

  Name  Age         Email  Address       Birth  favarite_no
서  홍길서   30  seo@hong.com   서울시 중구  1999-12-01            7
남  홍길남   21  nam@hong.com  서울시 강동구  1999-11-01            7
북  홍길북   22  buk@hong.com  서울시 관악구  1999-05-01            7
중  홍길중   23  mid@hong.com   부산시 중구  1999-01-30            7

In [247]:
member.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 서 to 중
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         4 non-null      object
 1   Age          4 non-null      int64
 2   Email        4 non-null      object
 3   Address      4 non-null      object
 4   Birth        4 non-null      object
 5   favarite_no  4 non-null      int64
dtypes: int64(2), object(4)
memory usage: 396.0+ bytes

In [248]:
# 데이터 프레임에 열 추가 2 : 
member['fn'] = [7,7,7, None] # 결측치 : None, np.nan, math.nan(import math)
member

  Name  Age         Email  Address       Birth  favarite_no   fn
서  홍길서   30  seo@hong.com   서울시 중구  1999-12-01            7  7.0
남  홍길남   21  nam@hong.com  서울시 강동구  1999-11-01            7  7.0
북  홍길북   22  buk@hong.com  서울시 관악구  1999-05-01            7  7.0
중  홍길중   23  mid@hong.com   부산시 중구  1999-01-30            7  NaN

In [249]:
# 결측치는 정수형 변환 불가(결측치 대체 후 형변환 필요) - float64 고정
# member['fn'].astype('int')

In [250]:
# 데이터 프레임에 열 추가3 : 시리즈로 추가
# member = pd.read_csv('data/ch11_member.csv', comment='#')
member['fn2'] = pd.Series([7,7,7], index=['동','서','남'])
member

  Name  Age         Email  Address       Birth  favarite_no   fn  fn2
서  홍길서   30  seo@hong.com   서울시 중구  1999-12-01            7  7.0  7.0
남  홍길남   21  nam@hong.com  서울시 강동구  1999-11-01            7  7.0  7.0
북  홍길북   22  buk@hong.com  서울시 관악구  1999-05-01            7  7.0  NaN
중  홍길중   23  mid@hong.com   부산시 중구  1999-01-30            7  NaN  NaN

In [227]:
pd.Series([7,7,7], index=[0,3,4])

0    7
3    7
4    7
dtype: int64

In [230]:
member = pd.read_csv('data/ch11_member.csv', comment='#')
member['fn'] = pd.Series(['test','test1','test2'], index=[0,3,4])
member

  Name  Age          Email  Address       Birth     fn
0  홍길동   20  hong@hong.com  서울시 강동구  1999-01-01   test
1  홍길서   30   seo@hong.com   서울시 중구  1999-12-01    NaN
2  홍길남   21   nam@hong.com  서울시 강동구  1999-11-01    NaN
3  홍길북   22   buk@hong.com  서울시 관악구  1999-05-01  test1
4  홍길중   23   mid@hong.com   부산시 중구  1999-01-30  test2

In [231]:
member.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     5 non-null      object
 1   Age      5 non-null      int64
 2   Email    5 non-null      object
 3   Address  5 non-null      object
 4   Birth    5 non-null      object
 5   fn       3 non-null      object
dtypes: int64(1), object(5)
memory usage: 368.0+ bytes

In [258]:
# 행 추가 : 추가할 데이터를 데이터프레임 -> 기존 df, 추가할 df 연결
member = pd.read_csv('data/ch11_member.csv')
member
new_member = pd.DataFrame([{
    'Name':'홍길숙',
    'Age':30,
    'Email':'h@h.com',
    'Address':'설',
    'Birth':'2001-01-01'
}])
new_member

  Name  Age    Email Address       Birth
0  홍길숙   30  h@h.com       설  2001-01-01

In [259]:
# 행 추가 시 member와 new_member 연결
member = pd.concat([member, new_member])
member

   Name  Age          Email  Address       Birth
0   홍길동   20  hong@hong.com  서울시 강동구  1999-01-01
1   홍길서   30   seo@hong.com   서울시 중구  1999-12-01
2   홍길남   21   nam@hong.com  서울시 강동구  1999-11-01
3   홍길북   22   buk@hong.com  서울시 관악구  1999-05-01
4   홍길중   23   mid@hong.com   부산시 중구  1999-01-30
5  #홍길뜽   24    non@not.com      없는구  2000-01-01
0   홍길숙   30        h@h.com        설  2001-01-01

In [261]:
pd.concat([member, new_member], axis=1) # axis = 0 : 기본값(행 연결)
                                        # axis = 1 : 열 연결

,Name,Age,Email,Address,Birth,Name,Age,Email,Address,Birth
0,홍길동,20,hong@hong.com,서울시 강동구,1999-01-01,홍길숙,30.0,h@h.com,설,2001-01-01
1,홍길서,30,seo@hong.com,서울시 중구,1999-12-01,NaN,NaN,NaN,NaN,NaN
2,홍길남,21,nam@hong.com,서울시 강동구,1999-11-01,NaN,NaN,NaN,NaN,NaN
3,홍길북,22,buk@hong.com,서울시 관악구,1999-05-01,NaN,NaN,NaN,NaN,NaN
4,홍길중,23,mid@hong.com,부산시 중구,1999-01-30,NaN,NaN,NaN,NaN,NaN
5,#홍길뜽,24,non@not.com,없는구,2000-01-01,NaN,NaN,NaN,NaN,NaN
0,홍길숙,30,h@h.com,설,2001-01-01,홍길숙,30.0,h@h.com,설,2001-01-01

In [263]:
a = pd.DataFrame({'kor':[10,20,30],
                  'mat':[40,50,60]})
b = pd.DataFrame({'eng':[10,20],
                  'sci':[44,55]})
pd.concat([a,b], axis=1)

   kor  mat   eng   sci
0   10   40  10.0  44.0
1   20   50  20.0  55.0
2   30   60   NaN   NaN

In [266]:
# 인덱스 재조정 
# member.index = range(len(member)) #(비추천)
member.reset_index(drop=True) # 기존의 index를 drop하고 새로운 연속된 index로 재조정
# member.reset_index() : 기존의 index를 컬럼에 편입시키고 새로운 연속된 index 생성
member

   Name  Age          Email  Address       Birth
0   홍길동   20  hong@hong.com  서울시 강동구  1999-01-01
1   홍길서   30   seo@hong.com   서울시 중구  1999-12-01
2   홍길남   21   nam@hong.com  서울시 강동구  1999-11-01
3   홍길북   22   buk@hong.com  서울시 관악구  1999-05-01
4   홍길중   23   mid@hong.com   부산시 중구  1999-01-30
5  #홍길뜽   24    non@not.com      없는구  2000-01-01
6   홍길숙   30        h@h.com        설  2001-01-01

# 6절. 병합과 연결
## 6.1 merge()를 이용한 병합

In [268]:
df1 = pd.DataFrame({'key':['a','b','c','d'],
                    'c1':[1,2,3,4]})
df2 = pd.DataFrame({'key':['a','b','c','e'],
                    'c2':[5,6,7,8]})
display(df1)
display(df2)

  key  c1
0   a   1
1   b   2
2   c   3
3   d   4

  key  c2
0   a   5
1   b   6
2   c   7
3   e   8

In [270]:
df1.merge(right=df2) # how = 'inner' : 양쪽 다 일치하는 데이터만 남김

  key  c1  c2
0   a   1   5
1   b   2   6
2   c   3   7

In [271]:
df1.merge(right=df2, how='left') # 왼쪽 데이터만 남기고 right에 매칭되는 것만 병합

  key  c1   c2
0   a   1  5.0
1   b   2  6.0
2   c   3  7.0
3   d   4  NaN

In [272]:
df1.merge(right=df2, how='right') # right 데이터만 남기고 왼쪽 데이터에 매칭되는 것만 병합

  key   c1  c2
0   a  1.0   5
1   b  2.0   6
2   c  3.0   7
3   e  NaN   8

In [273]:
df1.merge(df2, how='outer') # 양쪽 모두 다 남김

  key   c1   c2
0   a  1.0  5.0
1   b  2.0  6.0
2   c  3.0  7.0
3   d  4.0  NaN
4   e  NaN  8.0

In [275]:
df3 = pd.DataFrame({'key3':['a','b','c','d'],
                    'c1':[1,2,3,4]})
df4 = pd.DataFrame({'key4':['a','b','c','e'],
                    'c2':[5,6,7,8]})
display(df3)
display(df4)

  key3  c1
0    a   1
1    b   2
2    c   3
3    d   4

  key4  c2
0    a   5
1    b   6
2    c   7
3    e   8

In [277]:
df3.merge(right=df4, left_on='key3', right_on='key4', how='inner')

  key3  c1 key4  c2
0    a   1    a   5
1    b   2    b   6
2    c   3    c   7

In [282]:
df3.merge(right=df4, left_on='key3', right_on='key4', how='outer')

  key3   c1 key4   c2
0    a  1.0    a  5.0
1    b  2.0    b  6.0
2    c  3.0    c  7.0
3    d  4.0  NaN  NaN
4  NaN  NaN    e  8.0

In [278]:
df3.merge(df4, left_index=True, right_index=True) # pd.concat([df3, df4],1)와 유사

  key3  c1 key4  c2
0    a   1    a   5
1    b   2    b   6
2    c   3    c   7
3    d   4    e   8

## 6.2 concat()을 이용한 연결
- pd.concat( [df1, df2], axis)
    * axis=0(기본값) : 위아래로 연결 - 열 이름이 같아야함
    * axis=1        : 좌우로 연결 - 행 이름이 같아야함

In [281]:
df1 = pd.DataFrame({'key':['a','b','c','d'],
                    'c1':[1,2,3,4]})
df2 = pd.DataFrame({'key':['a','b','c','e'],
                    'c1':[5,6,7,8]})
pd.concat([df1, df2], axis=0).reset_index(drop=True)

  key  c1
0   a   1
1   b   2
2   c   3
3   d   4
4   a   5
5   b   6
6   c   7
7   e   8

In [283]:
df3 = pd.DataFrame({'key3':['a','b','c','d'],
                    'c1':[1,2,3,4]})
df4 = pd.DataFrame({'key4':['a','b','c','e'],
                    'c2':[5,6,7,8]})
pd.concat([df3,df4], axis=1)

  key3  c1 key4  c2
0    a   1    a   5
1    b   2    b   6
2    c   3    c   7
3    d   4    e   8

# 7절. 정렬(행/열이름, 값에 의한 정렬)
'100' < '9'
- df.sort_index(axis) : 행(axis=0) 또는 열(axis=1) 이름으로 정렬
- df.sort_values(by=정렬기준이 될 열이름, ascending=T/F, inplace=T/F) : 값에 의한 정렬

In [285]:
member = pd.read_csv('data/ch11_member.csv',comment='#')
member.index = ['동', '서','남','북','중']
member

  Name  Age          Email  Address       Birth
동  홍길동   20  hong@hong.com  서울시 강동구  1999-01-01
서  홍길서   30   seo@hong.com   서울시 중구  1999-12-01
남  홍길남   21   nam@hong.com  서울시 강동구  1999-11-01
북  홍길북   22   buk@hong.com  서울시 관악구  1999-05-01
중  홍길중   23   mid@hong.com   부산시 중구  1999-01-30

## 7.1 행이름으로 정렬

In [297]:
member.sort_index(axis=0)
# member.sort_index(axis='rows', ascending=False) # ascending = True : 기본값(오름차순 / False : 내림차순)
member.sort_index(axis='rows', inplace=True)
member

   Address  Age       Birth          Email Name
남  서울시 강동구   21  1999-11-01   nam@hong.com  홍길남
동  서울시 강동구   20  1999-01-01  hong@hong.com  홍길동
북  서울시 관악구   22  1999-05-01   buk@hong.com  홍길북
서   서울시 중구   30  1999-12-01   seo@hong.com  홍길서
중   부산시 중구   23  1999-01-30   mid@hong.com  홍길중

## 7.2 열이름으로 정렬

In [298]:
member.sort_index(axis=1)
member.sort_index(axis='columns', inplace=True) # ascending=True 기본값
member

   Address  Age       Birth          Email Name
남  서울시 강동구   21  1999-11-01   nam@hong.com  홍길남
동  서울시 강동구   20  1999-01-01  hong@hong.com  홍길동
북  서울시 관악구   22  1999-05-01   buk@hong.com  홍길북
서   서울시 중구   30  1999-12-01   seo@hong.com  홍길서
중   부산시 중구   23  1999-01-30   mid@hong.com  홍길중

## 7.3 값에 의한 정렬

In [295]:
member.sort_values(by='Age') # 'Age'열 데이터 기준으로 오름차순 정렬(ascending=True)

   Address  Age       Birth          Email Name
동  서울시 강동구   20  1999-01-01  hong@hong.com  홍길동
남  서울시 강동구   21  1999-11-01   nam@hong.com  홍길남
북  서울시 관악구   22  1999-05-01   buk@hong.com  홍길북
중   부산시 중구   23  1999-01-30   mid@hong.com  홍길중
서   서울시 중구   30  1999-12-01   seo@hong.com  홍길서

In [301]:
member.sort_values(by='Age', ascending=False, inplace=True) # 내림차순 정렬
member

   Address  Age       Birth          Email Name
서   서울시 중구   30  1999-12-01   seo@hong.com  홍길서
중   부산시 중구   23  1999-01-30   mid@hong.com  홍길중
북  서울시 관악구   22  1999-05-01   buk@hong.com  홍길북
남  서울시 강동구   21  1999-11-01   nam@hong.com  홍길남
동  서울시 강동구   20  1999-01-01  hong@hong.com  홍길동

In [305]:
# 'Address'기준으로 오름차순 정렬, 'Address'가 같으면 'Age'기준으로 정렬 (기본값 : 오름차순)
member.sort_values(by=['Address','Age'])

   Address  Age       Birth          Email Name
중   부산시 중구   23  1999-01-30   mid@hong.com  홍길중
동  서울시 강동구   20  1999-01-01  hong@hong.com  홍길동
남  서울시 강동구   21  1999-11-01   nam@hong.com  홍길남
북  서울시 관악구   22  1999-05-01   buk@hong.com  홍길북
서   서울시 중구   30  1999-12-01   seo@hong.com  홍길서

In [307]:
# 'Address'기준으로 오름차순 정렬, 'Address'가 같으면 'Age'를 내림차순으로 정렬
member.sort_values(by=['Address','Age'],
                   ascending=[True,False],
                   inplace=True)
member

   Address  Age       Birth          Email Name
중   부산시 중구   23  1999-01-30   mid@hong.com  홍길중
남  서울시 강동구   21  1999-11-01   nam@hong.com  홍길남
동  서울시 강동구   20  1999-01-01  hong@hong.com  홍길동
북  서울시 관악구   22  1999-05-01   buk@hong.com  홍길북
서   서울시 중구   30  1999-12-01   seo@hong.com  홍길서

In [316]:
# iris 데이터 셋
# (1)sepal_length값 기준(sepal_length가 같으면 sepal_width기준) 내림차순 정렬 적용(iris데이터 자체 변경)
# (2)행이름(index) 기준 정렬 적용(iris 데이터 자체 변경)
# (3)열이름(column) 기준 정렬한 내용을 출력(iris 데이터 변경 X)
# (1)
from seaborn import load_dataset
iris = sns.load_dataset('iris')
iris.sort_values(by=['sepal_length','sepal_width'],
                 ascending=False,
                 inplace=True)
iris.head()

     sepal_length  sepal_width  petal_length  petal_width    species
131           7.9          3.8           6.4          2.0  virginica
117           7.7          3.8           6.7          2.2  virginica
135           7.7          3.0           6.1          2.3  virginica
122           7.7          2.8           6.7          2.0  virginica
118           7.7          2.6           6.9          2.3  virginica

In [317]:
# (2)
iris.sort_index(inplace=True)
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [318]:
# (3)
iris.sort_index(axis=1)

     petal_length  petal_width  sepal_length  sepal_width    species
0             1.4          0.2           5.1          3.5     setosa
1             1.4          0.2           4.9          3.0     setosa
2             1.3          0.2           4.7          3.2     setosa
3             1.5          0.2           4.6          3.1     setosa
4             1.4          0.2           5.0          3.6     setosa
..            ...          ...           ...          ...        ...
145           5.2          2.3           6.7          3.0  virginica
146           5.0          1.9           6.3          2.5  virginica
147           5.2          2.0           6.5          3.0  virginica
148           5.4          2.3           6.2          3.4  virginica
149           5.1          1.8           5.9          3.0  virginica

[150 rows x 5 columns]